Module mdl_SQLite
    Public DB_CS_SQLite As String

    ''' <summary>
    ''' 接続文字列初期化
    ''' </summary>
    ''' <remarks>最初にこれを呼ばないと読み書きできないぜっ</remarks>
    Public Sub C_SQLiteInitialize()
        Dim strDBPath As String = System.IO.Path.ChangeExtension(System.Reflection.Assembly.GetExecutingAssembly().Location, "db")
        DB_CS_SQLite = "Version=3;Data Source=" & strDBPath & ";New=False;Compress=True;"

        If System.IO.File.Exists(strDBPath) = False Then
            C_SQLiteInitTable()
        End If
    End Sub

    ''' <summary>
    ''' テーブル初期化
    ''' </summary>
    Public Sub C_SQLiteInitTable()
        Using cn As New SQLite.SQLiteConnection(DB_CS_SQLite)
            'ｵﾌﾟｰﾝ
            cn.Open()

            'DB初期化
            Dim cmd As New SQLite.SQLiteCommand()
            cmd.Connection = cn

            Dim strSQL As String = "drop table if exists ライブテーブル;" &
             "drop table if exists 楽曲テーブル;" &
             "drop table if exists 声優テーブル;" &
             "drop table if exists 出演者テーブル;" &
             "drop table if exists 出演者詳細テーブル;" &
             "CREATE TABLE [ライブテーブル] (" &
                "[ライブid] INTEGER PRIMARY KEY AUTOINCREMENT," &
                "[ライブ名] TEXT," &
                "[ライブ日付] TEXT," &
                "[ライブデータ] TEXT);" &
             "CREATE TABLE [楽曲テーブル] (" &
                "[楽曲id] INTEGER PRIMARY KEY AUTOINCREMENT," &
                "[楽曲名] TEXT," &
                "[楽曲備考] TEXT);" &
             "CREATE TABLE [声優テーブル] (" &
                "[声優id] INTEGER PRIMARY KEY AUTOINCREMENT," &
                "[声優名] TEXT," &
                "[声優カナ名] TEXT," &
                "[声優役名] TEXT);" &
             "CREATE TABLE [出演者テーブル] (" &
                "[出演者id] INTEGER PRIMARY KEY AUTOINCREMENT," &
                "[声優id] INTEGER REFERENCES [声優テーブル]([声優id]) ON DELETE CASCADE ON UPDATE CASCADE," &
                "[ライブid] INTEGER REFERENCES [ライブテーブル]([ライブid]) ON DELETE CASCADE ON UPDATE CASCADE," &
                "[ゲスト] BOOLEAN);" &
             "CREATE TABLE [歌唱テーブル] (" &
                "[歌唱id] INTEGER PRIMARY KEY AUTOINCREMENT," &
                "[ライブid] INTEGER REFERENCES [ライブテーブル]([ライブid]) ON DELETE CASCADE ON UPDATE CASCADE," &
                "[曲順] INTEGER," &
                "[楽曲id] INTEGER REFERENCES [楽曲テーブル]([楽曲id]) ON DELETE CASCADE ON UPDATE CASCADE," &
                "[歌唱備考] TEXT);" &
             "CREATE TABLE [歌唱者テーブル] (" &
                "[歌唱者id] INTEGER PRIMARY KEY AUTOINCREMENT," &
                "[歌唱id] INTEGER REFERENCES [歌唱テーブル]([歌唱id]) ON DELETE CASCADE ON UPDATE CASCADE," &
                "[声優id] INTEGER REFERENCES [声優テーブル]([声優id]) ON DELETE CASCADE ON UPDATE CASCADE," &
                "[歌唱者フラグ] INTEGER);"
            cmd.CommandText = strSQL
            cmd.ExecuteNonQuery()

            '声優テーブル構築
            strSQL = "insert into 声優テーブル" &
                " (声優名,声優カナ名,声優役名)" &
                " values" &
                " ('会沢紗弥','あいざわさや','関裕美')," &
                " ('藍原ことみ','あいはらことみ','一ノ瀬志希')," &
                " ('青木志貴','あおきしき','二宮飛鳥')," &
                " ('青木瑠璃子','あおきるりこ','多田李衣菜')," &
                " ('赤﨑千夏','あかさきちなつ','日野茜')," &
                " ('朝井彩加','あさいあやか','早坂美玲')," &
                " ('天野聡美','あまのさとみ','白菊ほたる')," &
                " ('安齋由香里','あんざいゆかり','西園寺琴歌')," &
                " ('飯田友子','いいだゆうこ','速水奏')," &
                " ('五十嵐裕美','いがらしひろみ','双葉杏')," &
                " ('生田輝','いくたてる','ナターリア')," &
                " ('市ノ瀬加那','いちのせかな','ライラ')," &
                " ('井上ほの花','いのうえほのか','浅利七海')," &
                " ('今井麻夏','いまいあさか','佐々木千枝')," &
                " ('上坂すみれ','うえさかすみれ','アナスタシア')," &
                " ('内田真礼','うちだまあや','神崎蘭子')," &
                " ('梅澤めぐ','うめざわめぐ','辻野あかり')," &
                " ('桜咲千依','おうさきちよ','白坂小梅')," &
                " ('大木咲絵子','おおきさえこ','大石泉')," &
                " ('大空直美','おおぞらなおみ','緒方智絵里')," &
                " ('大坪由佳','おおつぼゆか','三村かな子')," &
                " ('大橋彩香','おおはしあやか','島村卯月')," &
                " ('金子真由美','かねこまゆみ','藤本里奈')," &
                " ('金子有希','かねこゆうき','高森藍子')," &
                " ('神谷早矢佳','かみたにさやか','南条光')," &
                " ('嘉山未紗','かやまみさ','脇山珠美')," &
                " ('河瀬茉希','かわせまき','桐生つかさ')," &
                " ('木村珠莉','きむらじゅり','相葉夕美')," &
                " ('久野美咲','くのみさき','市原仁奈')," &
                " ('黒沢ともよ','くろさわともよ','赤城みりあ')," &
                " ('小市眞琴','こいちまこと','結城晴')," &
                " ('小森結梨','こもりゆり','古賀小春')," &
                " ('佐倉薫','さくらかおる','黒埼ちとせ')," &
                " ('佐藤亜美菜','さとうあみな','橘ありす')," &
                " ('下地紫野','しもじしの','中野有香')," &
                " ('洲崎綾','すざきあや','新田美波')," &
                " ('鈴木絵理','すずきえり','堀裕子')," &
                " ('鈴木みのり','すずきみのり','藤原肇')," &
                " ('関口理咲','せきぐちりさ','白雪千夜')," &
                " ('高田憂希','たかだゆうき','依田芳乃')," &
                " ('髙野麻美','たかのあさみ','宮本フレデリカ')," &
                " ('高橋花林','たかはしかりん','森久保乃々')," &
                " ('高森奈津美','たかもりなつみ','前川みく')," &
                " ('竹達彩奈','たけたつあやな','輿水幸子')," &
                " ('武田羅梨沙多胡','たけだらりさたご','喜多見柚')," &
                " ('田澤茉純','たざわますみ','浜口あやめ')," &
                " ('立花日菜','たちばなひな','久川凪')," &
                " ('立花理香','たちばなりか','小早川紗枝')," &
                " ('田辺留依','たなべるい','荒木比奈')," &
                " ('種﨑敦美','たねざきあつみ','五十嵐響子')," &
                " ('集貝はな','ためがいはな','的場梨沙')," &
                " ('伊達朱里紗','だてありさ','難波笑美')," &
                " ('千菅春香','ちすがはるか','松永涼')," &
                " ('津田美波','つだみなみ','小日向美穂')," &
                " ('照井春佳','てるいはるか','櫻井桃華')," &
                " ('東山奈央','とうやまなお','川島瑞樹')," &
                " ('都丸ちよ','とまるちよ','椎名法子')," &
                " ('富田美憂','とみたみゆ','砂塚あきら')," &
                " ('中澤ミナ','なかざわみな','佐城雪美')," &
                " ('中島由貴','なかしまゆき','乙倉悠貴')," &
                " ('長江里加','ながえりか','久川颯')," &
                " ('長島光那','ながしまみな','上条春菜')," &
                " ('長野佑紀','ながのゆき','小関麗奈')," &
                " ('新田ひより','にったひより','道明寺歌鈴')," &
                " ('二ノ宮ゆい','にのみやゆい','八神マキノ')," &
                " ('のぐちゆり','のぐちゆり','及川雫')," &
                " ('花井美春','はないみはる','村上巴')," &
                " ('花谷麻妃','はなたにまき','遊佐こずえ')," &
                " ('花守ゆみり','はなもりゆみり','佐藤心')," &
                " ('早見沙織','はやみさおり','高垣楓')," &
                " ('原紗友里','はらさゆり','本田未央')," &
                " ('原涼子','はらすずこ','望月聖')," &
                " ('原田彩楓','はらださやか','三船美優')," &
                " ('原田ひとみ','はらだひとみ','十時愛梨')," &
                " ('原優子','はらゆうこ','向井拓海')," &
                " ('春瀬なつみ','はるせなつみ','龍崎薫')," &
                " ('春野ななみ','はるのななみ','上田鈴帆')," &
                " ('深川芹亜','ふかがわせりあ','喜多日菜子')," &
                " ('福原綾香','ふくはらあやか','渋谷凛')," &
                " ('藤田茜','ふじたあかね','水本ゆかり')," &
                " ('藤本彩花','ふじもとあやか','棟方愛海')," &
                " ('渕上舞','ふちがみまい','北条加蓮')," &
                " ('星希成奏','ほしきせえな','夢見りあむ')," &
                " ('M・A・O','まお','鷺沢文香')," &
                " ('牧野由依','まきのゆい','佐久間まゆ')," &
                " ('松井恵理子','まついえりこ','神谷奈緒')," &
                " ('松嵜麗','まつざきれい','諸星きらり')," &
                " ('松田颯水','まつださつみ','星輝子')," &
                " ('松永あかね','まつながあかね','イブ・サンタクロース')," &
                " ('三宅麻理恵','みやけまりえ','安部菜々')," &
                " ('村中知','むらなかとも','大和亜季')," &
                " ('森下来奈','もりしたらな','鷹富士茄子')," &
                " ('杜野まこ','もりのまこ','姫川友紀')," &
                " ('安野希世乃','やすのきよの','木村夏樹')," &
                " ('山下七海','やましたななみ','大槻唯')," &
                " ('山本希望','やまもとのぞみ','城ヶ崎莉嘉')," &
                " ('佳村はるか','よしむらはるか','城ヶ崎美嘉')," &
                " ('ルゥ・ティン','るぅてぃん','塩見周子')," &
                " ('和氣あず未','わきあずみ','片桐早苗')"
            cmd.CommandText = strSQL
            cmd.ExecuteNonQuery()
        End Using
    End Sub
End Module